Show / Hide Table of Contents
Class MatAnchorProperties
Anchor custom data
Inheritance
System.Object
MatAnchorProperties
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
public class MatAnchorProperties
Properties
Improve this Doc   View Source
FLS
Limit force in shear.
Declaration
public double FLS { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
FLT
Limit force in tension
Declaration
public double FLT { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
KS
Shear linear stiffness.
Declaration
public double KS { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
KSN
Nonlinear stiffness in shear after over loaded FLS
Declaration
public double KSN { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
KT
Tension linear stiffness.
Declaration
public double KT { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
KTN
Nonlinear stiffness in tension after over loaded FLT
Declaration
public double KTN { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Uls
Limit deformation in shear for stop solution UCRIT
Declaration
public double Uls { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Ult
Limit deformation in tension for stop solution UCRIT
Declaration
public double Ult { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source